app/controllers/queries_controller.rb

  def index
    @queries = Query.all
---
SELECT "queries".* FROM "queries"

  def create
    Query.create!(params[:query])
---
INSERT INTO "queries" ("query", "created_at", "updated_at") VALUES ('something', '2011-07-15 09:06:25.515312', '2011-07-15 09:06:25.515312') RETURNING "id"

  def destroy
    @query.delete
---
DELETE FROM "queries" WHERE "queries"."id" = 38

  def update
    if @query.update_attributes(params[:query])
---
UPDATE "queries" SET "updated_at" = '2011-07-18 22:39:54.175228', "query" = 'something1243' WHERE "queries"."id" = 77