app/views/queries/index.html.erb

SELECT "queries".* FROM "queries"
---
<%= javascript_include_tag "jquery-ui-1.8.14.custom.min" %>